src/main/resources/templates/request.vm

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soa="http://soa.sam.xm.com/">
	<soapenv:Header/>
	<soapenv:Body>
		<soa:submitSAMSettlementDataInput>
			<samSettlementDataInputAttachment>${body}</samSettlementDataInputAttachment>
		</soa:submitSAMSettlementDataInput>
	</soapenv:Body>
</soapenv:Envelope>